{
  "summary1": "Welcome to my personal website! I am Rithwik Gokhale, a software engineer with a passion for technology and innovation. Here, you can explore my journey, projects, and achievements.",
  "summary2": "I'm a Computer Engineering grad with a Data Science minor from Iowa State University, working at the crossroads of technology, analytics, and practical problem-solving. I enjoy turning complexity into clarity—whether that's through building smart systems, improving processes, or aligning tech solutions with business goals.",
  "summary3": "At Adatafy, I wear multiple hats across software engineering and technical product ownership. I lead digital transformation projects for clients in pharma, biofuels, and agriculture—taking them from initial scoping and stakeholder alignment all the way to deployment and adoption. My work involves close collaboration with cross-functional teams, hands-on development in Python and C#, and using tools like Tableau and MES systems to build solutions that improve efficiency, traceability, and operational insight.",
  "summary4": "Beyond coding, I regularly manage roadmapping discussions, lead project update meetings, gather feedback from end users, and help translate technical constraints into product decisions—skills that sit at the heart of technical product and program management.",
  "summary5": "In previous roles at Nvidia and Dolby, I worked on product strategy, XR prototyping, and enterprise project management. At Nvidia, I developed AR/VR prototypes for CloudXR, supported roadmap planning, and coordinated with internal and external stakeholders to demonstrate use cases in medical training. At Dolby, I applied Agile frameworks to improve cross-departmental collaboration and delivery efficiency.",
  "summary6": "I'm passionate about building tech that works for people—solutions that are not just functional, but intuitive, scalable, and aligned with the bigger picture. Always open to learning from others, sharing ideas, and exploring how we can drive impact through innovation."
}


