[
  {
    "company": "Adatafy (Novaspect)",
    "title": "Software Engineer (Product & Systems Lead) · Full-time",
    "startDate": "2022-06",
    "endDate": null,
    "dates": "June 2022 - Present",
    "location": "Schaumburg, Illinois · Hybrid",
    "highlights": [
      "Led 3–6 month digital transformation initiatives across Pharma, Biofuels, and Utilities, owning discovery → delivery → deployment with clear milestones, risks, and stakeholder alignment.",
      "Facilitated discovery workshops, process mapping, and requirement clarification with client SMEs; translated needs into epics, user stories, acceptance criteria, and phased release plans.",
      "Architected and implemented OT/IT data integrations using Inmation middleware + custom code to normalize/sort industrial data across MES tools and enterprise systems.",
      "Integrated MES platforms (Shiftconnector, Augmentir, Inmation) with SAP tools and broader ERP/CMMS/control-system environments via MES connectors, APIs, and database scripts where appropriate.",
      "Built deployment automation and environment configuration tooling in Python + PowerShell across VMs and client environments; reduced manual configuration time by 60% and improved repeatability/scalability.",
      "Added validation, logging, and health-check utilities to automation workflows to speed troubleshooting during cutovers and improve reliability across go-lives.",
      "Ran Agile delivery cadence (planning, standups, demos, retros) and maintained Jira/Confluence artifacts (backlog hygiene, release notes, decision logs) to keep cross-functional execution unblocked.",
      "Produced architecture diagrams and implementation documentation (MindManager diagrams, user guides, runbooks) to support onboarding, training, and long-term maintainability.",
      "Led client-facing demos, executive readouts, and steering-committee style stakeholder meetings; bridged technical constraints to business outcomes and adoption decisions.",
      "Drove UAT coordination, onboarding, and training; ensured implementations delivered real operational value (improved efficiency and reduced data errors), with every client returning for a Phase 2 expansion.",
      "Built a demo/reference environment for a new partner platform by mapping capabilities to common industry use cases; enabled Sales through demos, solution narratives, and technical enablement content, plus external thought leadership (webinars/podcast) and conference presentation."
    ],
    "techStack": ["Python", "PowerShell", "SQL", "REST APIs", "Virtual Machines", "Inmation", "MES (Shiftconnector, Augmentir)", "SAP/ERP", "CMMS", "OT/Control Systems", "Git", "CI/CD", "Jira", "Confluence", "MindManager"]
  },
  {
    "company": "NVIDIA",
    "title": "Enterprise XR Technical Product Management Intern · Internship",
    "dates": "May 2021 - Aug 2021 · 4 mos",
    "location": "Santa Clara, California · Remote",
    "highlights": [
      "Scoped and built Enterprise XR demo applications in Unity (C#) using CloudXR to enable internal validation and accelerate early stakeholder conversations in medical/enterprise contexts.",
      "Validated smooth demo performance across local (developer machine) and AWS EC2 environments, demonstrating parity in the demo experience and minimizing perceived latency during presentations.",
      "Partnered with a senior mentor to set up and troubleshoot cloud deployment workflows (environment setup, streaming checks, demo readiness) and unblock iteration velocity.",
      "Gathered stakeholder feedback and translated it into a prioritized iteration plan, clarifying demo requirements, success criteria, and testing workflows.",
      "Supported a VR medical training startup with CloudXR setup and integration, troubleshooting streaming/deployment issues and unblocking partner progress through hands-on technical enablement.",
      "Coordinated with University of Utah Medical School contacts to align demo scenarios with real user needs and inform early partnership discussions.",
      "Authored enablement notes and internal documentation (setup steps, test checklists, known issues) to reduce onboarding friction for internal teams and partners.",
      "Contributed technical content for an NVIDIA blog post, synthesizing partner insights to clearly position CloudXR's value for immersive medical education."
    ],
    "techStack": ["Unity", "C#", "CloudXR", "AWS EC2", "Git"]
  },
  {
    "company": "Dolby Laboratories",
    "title": "Enterprise Apps Project Management Intern · Internship",
    "dates": "Jan 2020 - Aug 2020 · 8 mos",
    "location": "San Francisco, California · Hybrid",
    "highlights": [
      "Rolled out Aha! integrated with Jira and Confluence across Finance, Marketing, and Legal by leading requirements gathering, workflow design, admin configuration, and stakeholder training; reduced cross-team sync meetings by 50%.",
      "Introduced Agile-lite delivery workflows (intake, prioritization, sprint cadence, retros) that reduced project cycle times by 30% and improved predictability.",
      "Translated business needs into epics/user stories and acceptance criteria; coordinated with technical owners/admins to configure workflows and streamline recurring processes.",
      "Built dashboards, custom views, and filters in Aha! to improve portfolio visibility (status, blockers, priorities), enabling IT managers and PMs to make more informed decisions.",
      "Supported roadmap planning for enterprise IT applications from concept through post-launch evaluation and iteration, ensuring alignment across stakeholders.",
      "Owned change management for adoption (documentation, office hours, communications), collecting feedback and iterating on processes to improve usability and consistency.",
      "Standardized status reporting and operating rhythms to increase transparency into delivery health and reduce ambiguity for cross-functional stakeholders.",
      "Documented process playbooks and governance guidelines for consistent usage across teams."
    ],
    "techStack": ["Aha!", "Jira", "Confluence", "Agile/Scrum", "Stakeholder Management", "Roadmapping", "Change Management"]
  }
]
